IDEA StatiCa Open Model
MaterialDuct Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Tendon ducts material type
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum MaterialDuct
Public Enumeration MaterialDuct
public enum class MaterialDuct
Members
Member name | Value | Description
Metal | 0 |  Metal
Plastic | 1 |  Plastic
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace